<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

return [
    'ads_type' => [
        1 => '首页广告',
        2 => '首页图标',
        3 => '首页banner',
        4 => 'APP启动图',
        5 => '直推列表banner',
        6 => '个人中心图标',
        7 => '顺顺福预约北景图',
        8 => '新人福包A区背景图',
        9 => '新人福包A区按钮',
        10 => '新人福包A区按钮背景图',
        11 => '新人福包B区按钮背景图',
        12 => '新人福包B区详情背景图',
        13 => '十二生肖套餐按钮背景图',
        14 => '十二生肖背景图',
        15 => '十二生肖套餐详情页背景图',
    ],
    'ads_link_type' => [0=>'无跳转',1=>'应用内页跳转'],
    'auth_status'=>[ 0 => '未认证', 1 => '通过'],
    'auth_label'=>[ 0 => 'orange', 1 => 'green',2 => 'gray'],
    'coupon_status'=>[ 2 => '失效', 1 => '正常'],
    'coupon_label'=>[ 2 => 'orange', 1 => 'green'],
    'coupon_list_status'=>[ 1 => '待使用',2 => '已使用', 3 => '已失效'],
    'coupon_list_label'=>[  1 => 'green',3=>'gray',2 => 'orange'],
    'city_agency' => [
        0 => '普通',
        1 => '城市代理',
    ],
    'station_agent' => [
        0 => '普通',
        1 => '驿站代理',
    ],
    'order_status_manage'=>[
        -1=>'已取消',
        10=>'已付款',
        1=>'待发货',
        2=>'待收货',
        3=>'已完成',
        4=>'已退款',
        9=>'待发货+已完成'
    ],
    'order_pay' => [
        0 => '正常订单',
        1 => '已失效',
    ],

];