<?php

// +----------------------------------------------------------------------
// | framework
// +----------------------------------------------------------------------
// | 版权所有 2014~2018 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://framework.thinkadmin.top
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zoujingli/framework
// +----------------------------------------------------------------------

return [
	// 应用调试模式
	'app_debug' => is_dev_server(),
	// 应用Trace调试
	'app_trace' => false,
    'default_module' => 'admin',
    'deny_module_list' => ['common'],
	// URL参数方式 0 按名称成对解析 1 按顺序解析
	'url_param_type' => 1,
    'url_domain_deploy' =>  true,//域名绑定
    //用户默认头像
    'user_default_headimg' => 'https://shop.gxqhydf520.com/static/ico/default_user.png',
    'vip_level' => ['普通用户','行政区代理人（区县级）','行政区代理人（市级）'],
    'ali_sms' => [
        'account' => 'LTAI5tPvSasU3c7b9SszmxVc',
        'password' => 'BOJuSJkwlX1qv3D59TD3O2cYMVlOtv',
        'signname' => '红韵串商',
        'tcode' => 'SMS_460940476'
    ],
    'account_mold' => [
        1 => '消费积分',
        2 => '贡献积分',
        3 => '绿色积分',
        4 => '福分',
        5 => '冻结福分'
    ],
    'bal_type'=>[
        1=>'系统操作-消费积分',
        2=>'系统操作-贡献积分',
        3=>'系统操作-绿色积分',
        4=>'系统操作-福分',
        5=>'系统操作-冻结福分',
        6=>'用户充值-消费积分',
        7=>'资产提现-消费积分',
        8=>'积分互转-消费积分',
        9=>'转出手续费-消费积分',
        10=>'购物消耗-消费积分',
        11=>'购物消耗-福分',
        12=>'购物订单退款退回-消费积分',
        13=>'购物订单退款退回-福分',
        14=>'冻结福分转换-冻结福分',
        15=>'冻结福分转换消费积分-消费积分',
        16=>'冻结福分转换贡献积分-贡献积分',
        17=>'冻结福分转换福分-福分',
        18=>'顺顺福预约消耗-消费积分',
        19=>'顺顺福未中单退款-消费积分',
        20=>'顺顺福未中单赠送福分-福分',
        21=>'顺顺福未中单返佣-福分',
        22=>'顺顺福未中单返佣消耗-绿色积分',
        23=>'购物获得-绿色积分',
        24=>'购物获得-贡献积分',
        25=>'直推购物获得-福分',
        26=>'代理人佣金（城市，驿站，行政区）-福分',
        27=>'提货券每日收益-福分',
        28=>'提货券每日收益-冻结福分',
        29=>'平仓券每日收益-消费积分',
        30=>'提现驳回-消费积分',
        31=>'顺顺福未中单赠送福分消耗-绿色积分',
        32=>'福分转换消费积分-消费积分',
        33=>'福分转换消费积分-福分',
        34=>'提货券每日收益消耗-绿色积分',
        35=>'APP每日购物分红-福分',
        36=>'APP每日购物分红消耗-绿色积分',
        37=>'直推购物获得福分消耗-绿色积分',
        38=>'团队提货券每日收益返佣-福分',
        39=>'团队提货券每日收益返佣消耗-绿色积分',
        40=>'代理人佣金（城市，驿站，行政区）消耗-绿色积分',
        41=>'积分区购物获得-消费积分',
        42=>'十二生肖购买获得消费积分'

    ],
    'integral_type'=>[1,6,7,8,9,10,12,15,18,19,29,30,32,41],
    'points_type'=>[2,16,24],
    'green_points'=>[3,22,23,31,34,36,37,39,40],
    'lot_type'=>[4,11,13,17,20,21,25,26,27,33,35,38],
    'freeze_lot'=>[5,14,28],
    'kuaidi'=>[
        '圆通速递'=>'yuantong',
        '韵达快递'=>'yunda',
        '中通快递'=>'zhongtong',
        '申通快递'=>'shentong',
        '极兔速递'=>'jtexpress',
        '邮政快递包裹'=>'youzhengguonei',
        '顺丰速运'=>'shunfeng',
        'EMS'=>'ems',
        '京东物流'=>'jd',
        '德邦快递'=>'debangkuaidi',
        '中通快运'=>'zhongtongkuaiyun',
        '韵达快运'=>'yundakuaiyun',
        '菜鸟速递'=>'danniao',
        '安得物流'=>'annto',
        '自提'=>'自提'
    ],
    
    'machine_lot'=>[6.13,0.7,0,0,0,0,0],//未中单福分返佣数量 1-7代
    'machine_lots'=>[0,0,0,0,0],//未中单福分返佣数量 8-12代

    'ORDER_STATUS' => [
        -1 => ['name' => '已失效', 'hide' => 1, 'label' => 'default', 'key' => -1],
        ['name' => '待付款', 'hide' => 0, 'label' => 'warning', 'key' => 0],
        ['name' => '待发货', 'hide' => 0, 'label' => 'info', 'key' => 1],
        ['name' => '待收货', 'hide' => 0, 'label' => 'purple', 'key' => 2],
        ['name' => '已完成', 'hide' => 0, 'label' => 'success', 'key' => 3],
        ['name' => '已退款', 'hide' => 1, 'label' => 'white', 'key' => 4]
    ],
    'goods_type'=>[
        1=>'普通区',
        2=>'精品区',
        3=>'兑换区',
        4=>'赠送区',
        5=>'会员A区',
        6=>'积分区',
        7=>'会员B区',
        8=>'十二生肖',
    ],
    'order_status_info'=>[
        0=>'待付款',
        1=>'待发货',
        2=>'待收货',
        3=>'已完成',
        4=>'已退款',
    ],
    'PAY_STATUS'=>[
        -1 => '未支付',
        1 => '消费积分支付',
        2 => '福分支付',
        3 => '支付宝支付',
        4 => '微信支付',
        5 => '提货券支付',
        6 => '权益券支付',
        7 => '易票联',
        8 => '快捷支付',
        9 => '支付宝-易票联',
        10 => '条码支付',
        11 => '微信支付-通道1',
        12 => '衫德快捷',
        13 => '衫德聚合',
        14 => '杉德收银台',
        15 => '盛付通-微信',
        16 => '盛付通-支付宝',
        17 => '微信支付-通道2',
    ],
    'lot_change'=>[
        ['label'=>'转换消费积分','value'=>1],
        ['label'=>'转换贡献积分','value'=>2],
        ['label'=>'转换福分','value'=>4]
    ],
    'ratio_change_lot'=>[
        1=>0.9,
        2=>0.3,
        4=>1
    ],
    'bal_withdraw_free'=>0.03,
    'BAL_ONLINE_MIN_AMOUNT'=>0.01,
    'trade_status' => [-1=>'已撤销',0=>'待付款',2=>'已打款',3=>'已完成'],
];
